Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.AnalyticalPanelSplitNothing Property
 The Analytical Panel cannot be split. The cutting plane does not intersect the panel in a way that creates a valid split.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AnalyticalPanelSplitNothing { get; }
Public Shared ReadOnly Property AnalyticalPanelSplitNothing As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AnalyticalPanelSplitNothing {
	FailureDefinitionId^ get ();
}
static member AnalyticalPanelSplitNothing : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace